tutorials/multiphase/LTSInterFoam/wigleyHull/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 5e-07;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 5e-07;
    }

    outlet
    {
        type            zeroGradient;
    }

    sides
    {
        type            symmetryPlane;
    }

    atmosphere
    {
        type            zeroGradient;
    }

    hull_wall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
